/*Завдання
Готель (потоки)

Розробити програму для моделювання роботи готелю у (прискореному) реальному часі.

Клас "готель": характеризується місткістю (скільки всього постояльців може прийняти) і пам'ятає список людей, які проживають
у ньому на даний момент.

Клас "заявка на проживання" характеризується прізвищем постояльця та
кількістю мілісекунд проживання.

У "готелі" є операції:

·   поселення "заявки" (або успішно поселяє і повертає true, або повертає false у разі нестачі вільних місць),
·   виселення заданої "заявки" (явно викликається самою заявкою в потрібний момент часу - готель не повинен самостійно
    відраховувати мілісекунди за кожного постояльця, тому що потенційно може продовжити своє проживання),
·   пошуку постояльця за прізвищем.


"Заявка" самостійно поселяється в готель, створюючи при цьому окремий потік (це може відбуватися як автоматично в конструкторі,
 так і у спеціальному методі). У разі неможливості оселитися, заявка переходить у режим очікування появи вільних місць.
 Після успішного поселення заявка відраховує (sleep) задану кількість мілісекунд - і виселяється, звільняючи місце у готелі.

Функція main намагається "поселити" до готелю кілька заявок. Але не одночасно, а через деякі проміжки часу – щоб
змоделювати ситуацію неодночасного їхнього приходу.

Клас "готель" виводить на екран діагностичні повідомлення, що повідомляють про операції поселення (успішного та безуспішного)
 та виселення - із зазначенням часу, інформації про заявку та кількість місць, що залишилися.
Потрібно наочно продемонструвати безуспішне поселення, очікування та подальше успішне поселення до готелю після виселення.*/

public class Main {
    public static void main(String[] args) {
        Hotel hotel = new Hotel(2);
        Thread t1 = new Thread(new AccommodationRequest(hotel, "Alice", 5000));
        Thread t2 = new Thread(new AccommodationRequest(hotel, "Bob", 7000));
        Thread t3 = new Thread(new AccommodationRequest(hotel, "Charlie", 4000));
        Thread t4 = new Thread(new AccommodationRequest(hotel, "Sofi", 6000));
        t1.start();
        try {
            Thread.sleep(1000);
        } catch (InterruptedException e) {
            e.printStackTrace();
        }
        t2.start();
        try {
            Thread.sleep(1000);
        } catch (InterruptedException e) {
            e.printStackTrace();
        }
        t3.start();
        try {
            Thread.sleep(1000);
        } catch (InterruptedException e) {
            e.printStackTrace();
        }
        t4.start();

    }
}